results/ai-agent-continuous/logs/baseline-logs/k6-baseline-run2.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 5 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 5 VUs  0m01.0s/1m0s

running (0m02.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 5 VUs  0m02.0s/1m0s

running (0m03.0s), 5/5 VUs, 4 complete and 0 interrupted iterations
default   [   5% ] 5 VUs  0m03.0s/1m0s

running (0m04.0s), 5/5 VUs, 4 complete and 0 interrupted iterations
default   [   7% ] 5 VUs  0m04.0s/1m0s

running (0m05.0s), 5/5 VUs, 9 complete and 0 interrupted iterations
default   [   8% ] 5 VUs  0m05.0s/1m0s

running (0m06.0s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [  10% ] 5 VUs  0m06.0s/1m0s

running (0m07.0s), 5/5 VUs, 14 complete and 0 interrupted iterations
default   [  12% ] 5 VUs  0m07.0s/1m0s

running (0m08.0s), 5/5 VUs, 17 complete and 0 interrupted iterations
default   [  13% ] 5 VUs  0m08.0s/1m0s

running (0m09.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  15% ] 5 VUs  0m09.0s/1m0s

running (0m10.0s), 5/5 VUs, 22 complete and 0 interrupted iterations
default   [  17% ] 5 VUs  0m10.0s/1m0s

running (0m11.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  18% ] 5 VUs  0m11.0s/1m0s

running (0m12.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  20% ] 5 VUs  0m12.0s/1m0s

running (0m13.0s), 5/5 VUs, 32 complete and 0 interrupted iterations
default   [  22% ] 5 VUs  0m13.0s/1m0s

running (0m14.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [  23% ] 5 VUs  0m14.0s/1m0s

running (0m15.0s), 5/5 VUs, 39 complete and 0 interrupted iterations
default   [  25% ] 5 VUs  0m15.0s/1m0s

running (0m16.0s), 5/5 VUs, 41 complete and 0 interrupted iterations
default   [  27% ] 5 VUs  0m16.0s/1m0s

running (0m17.0s), 5/5 VUs, 46 complete and 0 interrupted iterations
default   [  28% ] 5 VUs  0m17.0s/1m0s

running (0m18.0s), 5/5 VUs, 49 complete and 0 interrupted iterations
default   [  30% ] 5 VUs  0m18.0s/1m0s

running (0m19.0s), 5/5 VUs, 51 complete and 0 interrupted iterations
default   [  32% ] 5 VUs  0m19.0s/1m0s

running (0m20.0s), 5/5 VUs, 54 complete and 0 interrupted iterations
default   [  33% ] 5 VUs  0m20.0s/1m0s

running (0m21.0s), 5/5 VUs, 56 complete and 0 interrupted iterations
default   [  35% ] 5 VUs  0m21.0s/1m0s

running (0m22.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
default   [  37% ] 5 VUs  0m22.0s/1m0s

running (0m23.0s), 5/5 VUs, 63 complete and 0 interrupted iterations
default   [  38% ] 5 VUs  0m23.0s/1m0s

running (0m24.0s), 5/5 VUs, 66 complete and 0 interrupted iterations
default   [  40% ] 5 VUs  0m24.0s/1m0s

running (0m25.0s), 5/5 VUs, 69 complete and 0 interrupted iterations
default   [  42% ] 5 VUs  0m25.0s/1m0s

running (0m26.0s), 5/5 VUs, 71 complete and 0 interrupted iterations
default   [  43% ] 5 VUs  0m26.0s/1m0s

running (0m27.0s), 5/5 VUs, 74 complete and 0 interrupted iterations
default   [  45% ] 5 VUs  0m27.0s/1m0s

running (0m28.0s), 5/5 VUs, 78 complete and 0 interrupted iterations
default   [  47% ] 5 VUs  0m28.0s/1m0s

running (0m29.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
default   [  48% ] 5 VUs  0m29.0s/1m0s

running (0m30.0s), 5/5 VUs, 84 complete and 0 interrupted iterations
default   [  50% ] 5 VUs  0m30.0s/1m0s

running (0m31.0s), 5/5 VUs, 86 complete and 0 interrupted iterations
default   [  52% ] 5 VUs  0m31.0s/1m0s

running (0m32.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
default   [  53% ] 5 VUs  0m32.0s/1m0s

running (0m33.0s), 5/5 VUs, 92 complete and 0 interrupted iterations
default   [  55% ] 5 VUs  0m33.0s/1m0s

running (0m34.0s), 5/5 VUs, 96 complete and 0 interrupted iterations
default   [  57% ] 5 VUs  0m34.0s/1m0s

running (0m35.0s), 5/5 VUs, 97 complete and 0 interrupted iterations
default   [  58% ] 5 VUs  0m35.0s/1m0s

running (0m36.0s), 5/5 VUs, 102 complete and 0 interrupted iterations
default   [  60% ] 5 VUs  0m36.0s/1m0s

running (0m37.0s), 5/5 VUs, 106 complete and 0 interrupted iterations
default   [  62% ] 5 VUs  0m37.0s/1m0s

running (0m38.0s), 5/5 VUs, 107 complete and 0 interrupted iterations
default   [  63% ] 5 VUs  0m38.0s/1m0s

running (0m39.0s), 5/5 VUs, 112 complete and 0 interrupted iterations
default   [  65% ] 5 VUs  0m39.0s/1m0s

running (0m40.0s), 5/5 VUs, 114 complete and 0 interrupted iterations
default   [  67% ] 5 VUs  0m40.0s/1m0s

running (0m41.0s), 5/5 VUs, 116 complete and 0 interrupted iterations
default   [  68% ] 5 VUs  0m41.0s/1m0s

running (0m42.0s), 5/5 VUs, 120 complete and 0 interrupted iterations
default   [  70% ] 5 VUs  0m42.0s/1m0s

running (0m43.0s), 5/5 VUs, 123 complete and 0 interrupted iterations
default   [  72% ] 5 VUs  0m43.0s/1m0s

running (0m44.0s), 5/5 VUs, 127 complete and 0 interrupted iterations
default   [  73% ] 5 VUs  0m44.0s/1m0s

running (0m45.0s), 5/5 VUs, 129 complete and 0 interrupted iterations
default   [  75% ] 5 VUs  0m45.0s/1m0s

running (0m46.0s), 5/5 VUs, 133 complete and 0 interrupted iterations
default   [  77% ] 5 VUs  0m46.0s/1m0s

running (0m47.0s), 5/5 VUs, 135 complete and 0 interrupted iterations
default   [  78% ] 5 VUs  0m47.0s/1m0s

running (0m48.0s), 5/5 VUs, 139 complete and 0 interrupted iterations
default   [  80% ] 5 VUs  0m48.0s/1m0s

running (0m49.0s), 5/5 VUs, 142 complete and 0 interrupted iterations
default   [  82% ] 5 VUs  0m49.0s/1m0s

running (0m50.0s), 5/5 VUs, 144 complete and 0 interrupted iterations
default   [  83% ] 5 VUs  0m50.0s/1m0s

running (0m51.0s), 5/5 VUs, 149 complete and 0 interrupted iterations
default   [  85% ] 5 VUs  0m51.0s/1m0s

running (0m52.0s), 5/5 VUs, 152 complete and 0 interrupted iterations
default   [  87% ] 5 VUs  0m52.0s/1m0s

running (0m53.0s), 5/5 VUs, 154 complete and 0 interrupted iterations
default   [  88% ] 5 VUs  0m53.0s/1m0s

running (0m54.0s), 5/5 VUs, 157 complete and 0 interrupted iterations
default   [  90% ] 5 VUs  0m54.0s/1m0s

running (0m55.0s), 5/5 VUs, 160 complete and 0 interrupted iterations
default   [  92% ] 5 VUs  0m55.0s/1m0s

running (0m56.0s), 5/5 VUs, 163 complete and 0 interrupted iterations
default   [  93% ] 5 VUs  0m56.0s/1m0s

running (0m57.0s), 5/5 VUs, 166 complete and 0 interrupted iterations
default   [  95% ] 5 VUs  0m57.0s/1m0s

running (0m58.0s), 5/5 VUs, 168 complete and 0 interrupted iterations
default   [  97% ] 5 VUs  0m58.0s/1m0s

running (0m59.0s), 5/5 VUs, 172 complete and 0 interrupted iterations
default   [  98% ] 5 VUs  0m59.0s/1m0s

running (1m00.0s), 5/5 VUs, 174 complete and 0 interrupted iterations
default   [ 100% ] 5 VUs  1m00.0s/1m0s

running (1m01.0s), 2/5 VUs, 177 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  1m0s


  █ TOTAL RESULTS 

    checks_total.......: 179     2.891402/s
    checks_succeeded...: 100.00% 179 out of 179
    checks_failed......: 0.00%   0 out of 179

    ✓ is status 200 OK

    HTTP
    http_req_duration..............: avg=181.24ms min=157.18ms med=164.54ms max=1.17s p(90)=170.66ms p(95)=174.21ms
      { expected_response:true }...: avg=181.24ms min=157.18ms med=164.54ms max=1.17s p(90)=170.66ms p(95)=174.21ms
    http_req_failed................: 0.00%  0 out of 179
    http_reqs......................: 179    2.891402/s

    EXECUTION
    iteration_duration.............: avg=1.69s    min=1.18s    med=1.66s    max=4.73s p(90)=2.1s     p(95)=2.15s   
    iterations.....................: 179    2.891402/s
    vus............................: 2      min=2        max=5
    vus_max........................: 5      min=5        max=5

    NETWORK
    data_received..................: 1.9 MB 31 kB/s
    data_sent......................: 13 kB  211 B/s



running (1m01.9s), 0/5 VUs, 179 complete and 0 interrupted iterations
default ✓ [ 100% ] 5 VUs  1m0s